ls
# แสดงรายการไฟล์และโฟลเดอร์ในโฟลเดอร์ปัจจุบัน
# ls -l แสดงรายละเอียดไฟล์และโฟลเดอร์ในโฟลเดอร์ปัจจุบัน
# ls -a แสดงไฟล์และโฟลเดอร์ทั้งหมด รวมถึงไฟล์ที่ซ่อนอยู่
# ls -lrt แสดงรายการไฟล์และโฟลเดอร์ในโฟลเดอร์ปัจจุบัน โดยเรียงตามวันที่แก้ไขล่าสุด

cd
# เข้าไปในโฟลเดอร์ที่ระบุ ได้ทั้ง absolute path และ relative path เช่น
# cd /etc เข้าไปในโฟลเดอร์ /etc
# cd home/user เข้าไปในโฟลเดอร์ home/user จากโฟลเดอร์ปัจจุบัน
# cd .. ถอยออกมา directory ก่อนหน้า
# cd ~ เข้าไปในโฟลเดอร์ home ของผู้ใช้ปัจจุบัน

pwd
# แสดง path ปัจจุบัน

mkdir
# สร้างโฟลเดอร์ใหม่ เช่น
# mkdir myfolder สร้างโฟลเดอร์ myfolder ในโฟลเดอร์ปัจจุบัน
# mkdir -p /home/user/myfolder สร้างโฟลเดอร์ myfolder ใน /home/user โดยสร้างโฟลเดอร์ parent ถ้ายังไม่มี

rmdir
# ลบโฟลเดอร์ที่ว่าง เช่น
# rmdir myfolder ลบโฟลเดอร์ myfolder ถ้าโฟลเดอร์ว่าง
# rmdir -p /home/user/myfolder ลบโฟลเดอร์ myfolder และ parent ถ้าว่าง

rm
# ลบไฟล์หรือโฟลเดอร์ เช่น
# rm file.txt ลบไฟล์ file.txt
# rm -r myfolder ลบโฟลเดอร์ myfolder และไฟล์ภายในโฟลเดอร์
# rm -f file.txt ลบไฟล์ file.txt โดยไม่แสดงข้อความเตือน
# rm -rf myfolder ลบโฟลเดอร์ myfolder และไฟล์ภายในโฟลเดอร์ โดยไม่แสดงข้อความเตือน

cp
# คัดลอกไฟล์หรือโฟลเดอร์ เช่น
# cp file.txt /tmp/ คัดลอกไฟล์ file.txt ไปยังโฟลเดอร์ /tmp/
# cp -r myfolder /tmp/ คัดลอกโฟลเดอร์ myfolder และไฟล์ภายในไปยังโฟลเดอร์ /tmp/

mv
# ย้ายหรือเปลี่ยนชื่อไฟล์หรือโฟลเดอร์ เช่น
# mv file.txt /tmp/ ย้ายไฟล์ file.txt ไปยังโฟลเดอร์ /tmp/
# mv oldname.txt newname.txt เปลี่ยนชื่อไฟล์ oldname.txt เป็น newname.txt
# mv myfolder /tmp/ ย้ายโฟลเดอร์ myfolder ไปยังโฟลเดอร์ /tmp/

touch
# สร้างไฟล์เปล่าหรืออัปเดตเวลาการแก้ไข เช่น
# touch newfile.txt สร้างไฟล์ใหม่ชื่อ newfile.txt หรืออัปเดตเวลาการแก้ไขถ้าไฟล์มีอยู่แล้ว

vi
# แก้ไขไฟล์ข้อความหรือสร้างไฟล์ใหม่ เช่น
# vi file.txt เปิดไฟล์ file.txt เพื่อแก้ไข
# กด i เพื่อเข้าสู่โหมดแก้ไข
# กด Esc แล้วพิมพ์ :wq เพื่อบันทึกและออกจากโปรแกรม vi
# กด Esc แล้วพิมพ์ :q! เพื่อออกจากโปรแกรม vi โดยไม่บันทึก