
| คำสั่ง  | ใช้ทำอะไร         | ตัวอย่าง                    |
| ------- | ----------------- | --------------------------- |
| `chmod` | เปลี่ยนสิทธิ์ไฟล์ | `chmod 755 file.sh`         |
| `chown` | เปลี่ยนเจ้าของ    | `chown user:group file.txt` |
| `chgrp` | เปลี่ยนกลุ่ม      | `chgrp staff file.txt`      |

# การจัดการสิทธิ์ในการเข้าถึงไฟล์และโฟลเดอร์ผ่าน command line
chmod
# เปลี่ยนสิทธิ์ในการเข้าถึงไฟล์หรือโฟลเดอร์ เช่น
# chmod 755 file.sh ตั้งค่าสิทธิ์ rwxr-xr-x ให้กับไฟล์ file.sh คือ เจ้าของไฟล์มีสิทธิ์อ่าน เขียน และรัน, กลุ่มมีสิทธิ์อ่านและรัน, และผู้ใช้อื่นมีสิทธิ์อ่านและรัน
# chmod 644 file.txt ตั้งค่าสิทธิ์ rw-r--r-- ให้กับไฟล์ file.txt คือ เจ้าของไฟล์มีสิทธิ์อ่านและเขียน, กลุ่มมีสิทธิ์อ่าน, และผู้ใช้อื่นมีสิทธิ์อ่าน
# chmod -R 700 myfolder ตั้งค่าสิทธิ์ rwx------ ให้กับโฟลเดอร์ myfolder และไฟล์ภายในโฟลเดอร์นั้น

chown
# เปลี่ยนเจ้าของไฟล์หรือโฟลเดอร์ เช่น
# chown user file.txt เปลี่ยนเจ้าของไฟล์ file.txt เป็น user
# chown user:group file.txt เปลี่ยนเจ้าของไฟล์ file.txt เป็น user และกลุ่มเป็น group
# chown -R user:group myfolder เปลี่ยนเจ้าของโฟลเดอร์ myfolder และไฟล์ภายในโฟลเดอร์นั้นเป็น user และกลุ่มเป็น group

chgrp
# เปลี่ยนกลุ่มของไฟล์หรือโฟลเดอร์ เช่น
# chgrp group file.txt เปลี่ยนกลุ่มของไฟล์ file.txt เป็น group
# chgrp -R group myfolder เปลี่ยนกลุ่มของโฟลเดอร์ myfolder และไฟล์ภายในโฟลเดอร์นั้นเป็น group
